// 成功状态
export const SUCCESS = 'success'
// 失败状态
export const FAIL = 'fail'
// 编译设置值
export const COMPILE_SETTINGS = [
  {
    key: 'es6: 对应小程序开发者工具的 "es6 转 es5',
    value: 'es6'
  },
  {
    key: 'es7: 对应小程序开发者工具的 "增强编译"',
    value: 'es7'
  },
  {
    key: 'minifyJS: 压缩 JS 代码',
    value: 'minifyJS'
  },
  {
    key: 'minifyWXML: 压缩 WXML 代码',
    value: 'minifyWXML'
  },
  {
    key: 'minifyWXSS: 压缩 WXSS 代码',
    value: 'minifyWXSS'
  },
  {
    key: 'minify: 压缩所有代码，对应小程序开发者工具的 "压缩代码"',
    value: 'minify'
  },
  {
    key: 'codeProtect: 对应小程序开发者工具的 "代码保护"',
    value: 'codeProtect'
  },
  {
    key: 'autoPrefixWXSS: 对应小程序开发者工具的 "样式自动补全"',
    value: 'autoPrefixWXSS'
  }
]
// 场景scenes值
export const SCENE = [
  {
    key: '1000: 其他',
    value: 1000
  },
  {
    key: '1001: 发现栏小程序主入口，「最近使用」列表（基础库2.2.4版本起包含「我的小程序」列表）',
    value: 1001
  },
  {
    key: '1005: 微信首页顶部搜索框的搜索结果页',
    value: 1005
  },
  {
    key: '1006: 发现栏小程序主入口搜索框的搜索结果页',
    value: 1006
  },
  {
    key: '1007: 单人聊天会话中的小程序消息卡片',
    value: 1007
  },
  {
    key: '1008: 群聊会话中的小程序消息卡片',
    value: 1008
  },
  {
    key: '1010: 收藏夹',
    value: 1010
  },
  {
    key: '1011: 扫描二维码',
    value: 1011
  },
  {
    key: '1012: 长按图片识别二维码',
    value: 1012
  },
  {
    key: '1013: 扫描手机相册中选取的二维码',
    value: 1013
  },
  {
    key: '1014: 小程序订阅消息（与1107相同）',
    value: 1014
  },
  {
    key: '1017: 前往小程序体验版的入口页',
    value: 1017
  },
  {
    key: '1019: 微信钱包（微信客户端7.0.0版本改为支付入口）',
    value: 1019
  },
  {
    key: '1023: 安卓系统桌面图标',
    value: 1023
  },
  {
    key: '1024: 小程序 profile 页',
    value: 1024
  },
  {
    key: '1025: 扫描一维码',
    value: 1025
  },
  {
    key: '1026: 发现栏小程序主入口，「附近的小程序」列表',
    value: 1026
  },
  {
    key: '1027: 微信首页顶部搜索框搜索结果页「使用过的小程序」列表',
    value: 1027
  },
  {
    key: '1028: 我的卡包',
    value: 1028
  },
  {
    key: '1029: 小程序中的卡券详情页',
    value: 1029
  },
  {
    key: '1030: 自动化测试下打开小程序',
    value: 1030
  },
  {
    key: '1031: 长按图片识别一维码',
    value: 1031
  },
  {
    key: '1032: 扫描手机相册中选取的一维码',
    value: 1032
  },
  {
    key: '1034: 微信支付完成页',
    value: 1034
  },
  {
    key: '1035: 公众号自定义菜单',
    value: 1035
  },
  {
    key: '1036: App 分享消息卡片',
    value: 1036
  },
  {
    key: '1037: 小程序打开小程序',
    value: 1037
  },
  {
    key: '1038: 从另一个小程序返回',
    value: 1038
  },
  {
    key: '1039: 摇电视',
    value: 1039
  },
  {
    key: '1042: 添加好友搜索框的搜索结果页',
    value: 1042
  },
  {
    key: '1043: 公众号模板消息',
    value: 1043
  },
  {
    key: '1044: 带 shareTicket 的小程序消息卡片',
    value: 1044
  },
  {
    key: '1045: 朋友圈广告',
    value: 1045
  },
  {
    key: '1046: 朋友圈广告详情页',
    value: 1046
  },
  {
    key: '1047: 扫描小程序码',
    value: 1047
  },
  {
    key: '1048: 长按图片识别小程序码',
    value: 1048
  },
  {
    key: '1049: 扫描手机相册中选取的小程序码',
    value: 1049
  },
  {
    key: '1052: 卡券的适用门店列表',
    value: 1052
  },
  {
    key: '1053: 搜一搜的结果页',
    value: 1053
  },
  {
    key: '1054: 顶部搜索框小程序快捷入口（微信客户端版本6.7.4起废弃',
    value: 1054
  },
  {
    key: '1056: 聊天顶部音乐播放器右上角菜单',
    value: 1056
  },
  {
    key: '1057: 钱包中的银行卡详情页',
    value: 1057
  },
  {
    key: '1058: 公众号文章',
    value: 1058
  },
  {
    key: '1059: 体验版小程序绑定邀请页',
    value: 1059
  },
  {
    key: '1060: 微信支付完成页（与1034相同）',
    value: 1060
  },
  {
    key: '1064: 微信首页连Wi-Fi状态栏',
    value: 1064
  },
  {
    key: '1065: URL scheme',
    value: 1065
  },
  {
    key: '1067: 公众号文章广告',
    value: 1067
  },
  {
    key: '1068: 附近小程序列表广告（已废弃）',
    value: 1068
  },
  {
    key: '1069: 移动应用通过openSDK进入微信，打开小程序',
    value: 1069
  },
  {
    key: '1071: 钱包中的银行卡列表页',
    value: 1071
  },
  {
    key: '1072: 二维码收款页面',
    value: 1072
  },
  {
    key: '1073: 客服消息列表下发的小程序消息卡片',
    value: 1073
  },
  {
    key: '1074: 公众号会话下发的小程序消息卡片',
    value: 1074
  },
  {
    key: '1077: 摇周边',
    value: 1077
  },
  {
    key: '1078: 微信连Wi-Fi成功提示页',
    value: 1078
  },
  {
    key: '1079: 微信游戏中心',
    value: 1079
  },
  {
    key: '1081: 客服消息下发的文字链',
    value: 1081
  },
  {
    key: '1082: 公众号会话下发的文字链',
    value: 1082
  },
  {
    key: '1084: 朋友圈广告原生页',
    value: 1084
  },
  {
    key: '1088: 会话中查看系统消息，打开小程序',
    value: 1088
  },
  {
    key: '1089: 微信聊天主界面下拉，「最近使用」栏（基础库2.2.4版本起包含「我的小程序」栏）',
    value: 1089
  },
  {
    key: '1090: 长按小程序右上角菜单唤出最近使用历史',
    value: 1090
  },
  {
    key: '1091: 公众号文章商品卡片',
    value: 1091
  },
  {
    key: '1092: 城市服务入口',
    value: 1092
  },
  {
    key: '1095: 小程序广告组件',
    value: 1095
  },
  {
    key: '1096: 聊天记录，打开小程序',
    value: 1096
  },
  {
    key: '1097: 微信支付签约原生页，打开小程序',
    value: 1097
  },
  {
    key: '1099: 页面内嵌插件',
    value: 1099
  },
  {
    key: '1100: 红包封面详情页打开小程序',
    value: 1100
  },
  {
    key: '1101: 远程调试热更新（开发者工具中，预览 -> 自动预览 -> 编译并预览）',
    value: 1101
  },
  {
    key: '1102: 公众号 profile 页服务预览',
    value: 1102
  },
  {
    key: '1103: 发现栏小程序主入口，「我的小程序」列表（基础库2.2.4版本起废弃）',
    value: 1103
  },
  {
    key: '1104: 微信聊天主界面下拉，「我的小程序」栏（基础库2.2.4版本起废弃）',
    value: 1104
  },
  {
    key: '1106: 聊天主界面下拉，从顶部搜索结果页，打开小程序',
    value: 1106
  },
  {
    key: '1107: 订阅消息，打开小程序',
    value: 1107
  },
  {
    key: '1113: 安卓手机负一屏，打开小程序（三星）',
    value: 1113
  },
  {
    key: '1114: 安卓手机侧边栏，打开小程序（三星）',
    value: 1114
  },
  {
    key: '1119: 【企业微信】工作台内打开小程序',
    value: 1119
  },
  {
    key: '1120: 【企业微信】个人资料页内打开小程序',
    value: 1120
  },
  {
    key: '1121: 【企业微信】聊天加号附件框内打开小程序',
    value: 1121
  },
  {
    key: '1124: 扫“一物一码”打开小程序',
    value: 1124
  },
  {
    key: '1125: 长按图片识别“一物一码”',
    value: 1125
  },
  {
    key: '1126: 扫描手机相册中选取的“一物一码”',
    value: 1126
  },
  {
    key: '1129: 微信爬虫访问',
    value: 1129
  },
  {
    key: '1131: 浮窗（8.0版本起仅包含被动浮窗）',
    value: 1131
  },
  {
    key: '1133: 硬件设备打开小程序',
    value: 1133
  },
  {
    key: '1135: 小程序profile页相关小程序列表，打开小程序',
    value: 1135
  },
  {
    key: '1144: 公众号文章 - 视频贴片',
    value: 1144
  },
  {
    key: '1145: 发现栏 - 发现小程序',
    value: 1145
  },
  {
    key: '1146: 地理位置信息打开出行类小程序',
    value: 1146
  },
  {
    key: '1148: 卡包-交通卡，打开小程序',
    value: 1148
  },
  {
    key: '1150: 扫一扫商品条码结果页打开小程序	',
    value: 1150
  },
  {
    key: '1151: 发现栏 - 我的订单',
    value: 1151
  },
  {
    key: '1152: 订阅号视频打开小程序',
    value: 1152
  },
  {
    key: '1153: “识物”结果页打开小程序',
    value: 1153
  },
  {
    key: '1154: 朋友圈内打开“单页模式”',
    value: 1154
  },
  {
    key: '1155: “单页模式”打开小程序',
    value: 1155
  },

  {
    key: '1157: 服务号会话页打开小程序',
    value: 1157
  },
  {
    key: '1158: 群工具打开小程序',
    value: 1158
  },
  {
    key: '1160: 群待办',
    value: 1160
  },
  {
    key: '1167: H5 通过开放标签打开小程序',
    value: 1167
  },
  {
    key: '1168: 移动应用直接运行小程序',
    value: 1168
  },
  {
    key: '1169: 发现栏小程序主入口，各个生活服务入口（例如快递服务、出行服务等）',
    value: 1169
  },
  {
    key: '1171: 微信运动记录（仅安卓）',
    value: 1171
  },
  {
    key: '1173: 聊天素材用小程序打开',
    value: 1173
  },
  {
    key: '1175: 视频号主页商店入口',
    value: 1175
  },
  {
    key: '1176: 视频号直播间主播打开小程序',
    value: 1176
  },
  {
    key: '1177: 视频号直播商品',
    value: 1177
  },
  {
    key: '1178: 在电脑打开手机上打开的小程序',
    value: 1178
  },
  {
    key: '1179: #话题页打开小程序',
    value: 1179
  },
  {
    key: '1181: 网站应用打开PC小程序',
    value: 1181
  },
  {
    key: '1183: PC微信 - 小程序面板 - 发现小程序 - 搜索',
    value: 1183
  },
  {
    key: '1185: 群公告',
    value: 1185
  },
  {
    key: '1186: 收藏 - 笔记',
    value: 1186
  },
  {
    key: '1187: 浮窗（8.0版本起）',
    value: 1187
  },
  {
    key: '1189: 表情雨广告',
    value: 1189
  },
  {
    key: '1191: 视频号活动',
    value: 1191
  },
  {
    key: '1192: 企业微信联系人profile页',
    value: 1192
  },

  {
    key: '1194: 收藏 - 笔记',
    value: 1194
  },
  {
    key: '1195: 视频号主页商品tab',
    value: 1195
  },
  {
    key: '1197: 视频号主播从直播间返回小游戏',
    value: 1197
  },
  {
    key: '1198: 视频号开播界面打开小游戏',
    value: 1198
  },
  {
    key: '1203: 微信小程序压测工具的请求',
    value: 1203
  }
]
